Tekla Open API Reference for Tekla Structures 2025
CannotInsertDrawingException Class
 The CannotInsertDrawingException class defines the exception that is thrown when a user tries to insert a drawing when another drawing is active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotInsertDrawingException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotInsertDrawingException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotInsertDrawingException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotInsertDrawingException type exposes the following members.
Constructors
Name | Description
CannotInsertDrawingException
 Creates a new cannot insert drawing exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace